{
    "abstract": " <p>In sparse principal component analysis we are given noisy observations of a low-rank matrix of dimension $n\\times p$ and seek to reconstruct it under additional sparsity assumptions. In particular, we assume here each of the principal components $v_1,\\dots,v_r$ has at most $s_0$ non-zero entries. We are particularly interested in the high dimensional regime wherein $p$ is comparable to, or even much larger than $n$.</p> <p>In an influential paper, Johnstone and Lu (2004) introduced a simple algorithm that estimates the support of the principal vectors $v_1,\\dots,v_r$ by the largest entries in the diagonal of the empirical covariance. This method can be shown to identify the correct support with high probability if $s_0\\le K_1\\sqrt{n/\\log p}$, and to fail with high probability if $s_0\\ge K_2 \\sqrt{n/\\log p}$ for two constants $0<k_1,k_2<\\infty$. a=\"\" algorithm=\"\" amount=\"\" better=\"\" considerable=\"\" despite=\"\" exists=\"\" guarantees.<=\"\" last=\"\" no=\"\" of=\"\" over=\"\" p=\"\" practical=\"\" provably=\"\" recovery=\"\" support=\"\" ten=\"\" the=\"\" with=\"\" work=\"\" years,=\"\"> <p>Here we analyze a covariance thresholding algorithm that was recently proposed by Krauthgamer, Nadler, Vilenchik, et al. (2015). On the basis of numerical simulations (for the rank-one case), these authors conjectured that covariance thresholding correctly recover the support with high probability for $s_0\\le K\\sqrt{n}$ (assuming $n$ of the same order as $p$). We prove this conjecture, and in fact establish a more general guarantee including higher-rank as well as $n$ much smaller than $p$. Recent lower bounds (Berthet and Rigollet, 2013; Ma and Wigderson, 2015) suggest that no polynomial time algorithm can do significantly better.</p> <p>The key technical component of our analysis develops new bounds on the norm of kernel random matrices, in regimes that were not considered before. Using these, we also derive sharp bounds for estimating the population covariance, and the principal component (with $\\ell_2$-loss).</p>",
    "authors": [
        "Yash Deshpande",
        "Andrea Montanari"
    ],
    "id": "15-160",
    "issue": 141,
    "pages": [
        1,
        41
    ],
    "title": "Sparse PCA via Covariance Thresholding",
    "volume": 17,
    "year": 2016
}